/** 正则匹配规则 - 中文字符 */
export const CN_CHAR = /^[\u4E00-\u9FA5]+$/gm

/** 正则匹配规则 - 手机号 */
export const MOBILE_NUM
  = /^(?:(?:\+|00)86)?1(?:(?:3[\d])|(?:4[5-79])|(?:5[0-35-9])|(?:6[5-7])|(?:7[0-8])|(?:8[\d])|(?:9[189]))\d{8}$/

/** 正则匹配规则 - 身份证号 */
export const ID_NUM
  = /^[1-9]\d{5}(?:18|19|20)\d{2}(?:0[1-9]|10|11|12)(?:0[1-9]|[1-2]\d|30|31)\d{3}[0-9Xx]$/

/** 正则匹配规则 - MAC 地址 */
export const MAC_ADDR
  = /^(?:(?:[a-f0-9A-F]{2}:){5}|(?:[a-f0-9A-F]{2}-){5})[a-f0-9A-F]{2}$/

/** 正则匹配规则 - 管理员名称 */
export const ADMIN_NAME = /^[@-_.#a-zA-Z0-9\u4E00-\u9FA5]+$/gm
